#include <stdio.h>
#include <stdlib.h>
// gcc <ชื่อไฟล์> คือ การ compiler ไฟล์นั้นๆ ให้เป็น machine language เพื่อให้คอมพิวเตอร์เข้าใจและทำงานตามไฟล์นั้นๆ
// bool ใน c คือ เลขทุกอย่าง(ยกเว้น 0) อักษาทุกอย่าง (ยกเว้นบรรทัดว่าง [ไม่ใช่ space bar])
int main() {
    char a[10];
    int b;
    gets(a); //รับค่า a หลายๆตัว เป็น char
        /*getc(a) รับค่าแค่ตัวเดียว เป็น chargit ini
        /fgets(a,X,stdin) X คือ ขนาดของตัวแปร stdin คือ ที่ที่ระบุไฟล์*/
    b=atoi(a); //แปลง type char เป็น int
        /*atof คือ array to float
        /atol คือ array to long int*/
    if (b==0 || b==1 && b!=2)
        // ..==.. คือ ถ้าตัวหน้า เหมือนตัวหลังจะให้ค่า bool เป็น จริง
        /*> คือ ตัวหน้ามากกว่าตัวหลังมั้ย ถ้าใช่ bool เป็น จริง [ในกรณีที่เป็นค่า char จะเทียบตามหลักบรรณานุกรม]
          < คล้ายๆกับ > คือ ถ้าตัวหลังมากกว่าตัวหน้า จะให้ค่า bool เป็น จริง
          != คือ เป็นการเทียบระหว่างตัวหน้ากับตัวหลังว่าเหมือนกันหรือไม่ ถ้าเหมือนได้ bool เป็น จริง ถ้าไม่เหมือน ได้ bool เป็น เท็จ
          >= คือ เป็นจริงเมื่อ ตัวหน้ามากกว่าหรือเท่ากับตัวหลัง เป็นเท็จเมื่อตัวหน้าน้อยกวา่ตัวหลัง
          ซึ่ง ถ้าเป็น <= จะทำงานสลับกับ >= */

          /*|| คือการเปรียบเทียบว่า 2 expression expression ไหนเป็นจริงอย่างน้อย 1 expression ก็ให้ค่าเป็น จริง ถ้า 2 expression เป็นเท็จ ก็จะให้ค่า เท็จ
            && คือการเปรียบเทียบว่า 2 expression expression ถ้าเป็นจริงหมด ก็ให้ค่าเป็น จริง ถ้ามี expression ใดเป็นเท็จ ก็จะให้ค่า เท็จ
            !  คือสลับค่าคามจริง กล่าวว่า ถ้าเป็นจริง แล้วใส่ !เข้าไปข้างหน้าจะได้เป็น เท็จ Ex. 1 จะได้ True แต่ถ้า !1 จะได้ False*/
        //ปกติ if จะใช้ได้แค่ statements เดียว ถ้าอยากใช้หลายๆ statements ให้ {...}หลัง if
        printf("it's 2 base");
    else
        printf("Nah IDK what is this");
    return 0;
}